#include "Sht2D_TitleScene.h"

#include "../GameObject/TitleSceneObjects/TitleSceneLogo/Sht2D_TitleSceneLogo.h"
#include "../GameObject/TitleSceneObjects/TitleSceneMenu/Sht2D_TitleSceneMenu.h"

void Sht2D_TitleScene::start()
{
  /*┌────────────────────────────────────────────────────────────────────────────────────────
	│ゲームの要素を表現する時、このフレームワークでは「GameObject」と「Component」という概念を使います。
	│　下２行で呼ばれている関数内でそれらを作っています。
	└────────────────────────────────────────────────────────────────────────────────────────*/


  /*┌────────────────────────────────────────────────────────────────────────────────────────
	│　下の「Sht2D_TitleSceneLogo」をシングルクリック＆F12キーを入力してソースファイルに飛んで下さい。
	└────────────────────────────────────────────────────────────────────────────────────────*/

	// タイトルシーンのロゴオブジェクトを作る
	Sht2D_TitleSceneLogo::create();


  /*┌────────────────────────────────────────────────────────────────────────────────────────
	│　下の「Sht2D_TitleSceneMenu」をシングルクリック＆F12キーを入力してソースファイルに飛んで下さい。
	└────────────────────────────────────────────────────────────────────────────────────────*/

	// タイトルシーンのメニューオブジェクト
	Sht2D_TitleSceneMenu::create();
}
