#ifndef SHT_2D_LOADING_SCENE_H_
#define SHT_2D_LOADING_SCENE_H_

#include <TktkDX12GameLib.h>

  /*┌────────────────────────────────────────────────────────────────────────────────────────
	│シーンクラスを作る時は「tktk::SceneBase」を継承して下さい。
	│　関数は「void start()」と「void end()」が使えます。
	│　※関数はダックタイピング的に呼ばれるので、overrideは必要ありません
	└────────────────────────────────────────────────────────────────────────────────────────*/

// ローディングシーン
class Sht2D_LoadingScene
	: public tktk::SceneBase
{
public:

  /*┌────────────────────────────────────────────────────────────────────────────────────────
	│下の「start()」をシングルクリック＆F12キーを入力してソースファイルに飛んで下さい。
	└────────────────────────────────────────────────────────────────────────────────────────*/

	void start();
};
#endif // !SHT_2D_LOADING_SCENE_H_