#ifndef SHT_2D_TITLE_SCENE_LOGO_H_
#define SHT_2D_TITLE_SCENE_LOGO_H_

#include <TktkDX12GameLib.h>

  /*┌────────────────────────────────────────────────────────────────────────────────────────
	│タイトルシーンロゴ作成構造体、関数については特に条件はありません。
	│　※戻り値に「tktk::GameObjectPtr」が設定されていますが、今回は使用されていません。
	└────────────────────────────────────────────────────────────────────────────────────────*/

// タイトルシーンのロゴオブジェクト
struct Sht2D_TitleSceneLogo
{
  /*┌────────────────────────────────────────────────────────────────────────────────────────
	│下の「create()」をシングルクリック＆F12キーを入力してソースファイルに飛んで下さい。
	└────────────────────────────────────────────────────────────────────────────────────────*/

	static tktk::GameObjectPtr create();
};
#endif // !SHT_2D_TITLE_SCENE_LOGO_H_